; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	image1 - mode
	infrared2 - mode
	image0 - mode
	Star1 - direction
	Star2 - direction
	Star5 - direction
	Star4 - direction
	Star0 - direction
	GroundStation3 - direction
	Planet6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Phenomenon9 - direction
	Star10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Planet14 - direction
	Star15 - direction
	Planet16 - direction
	Star17 - direction
	Planet18 - direction
	Planet19 - direction
)
(:init
	(supports instrument0 image1)
	(supports instrument0 infrared2)
	(calibration_target instrument0 Star4)
	(supports instrument1 infrared2)
	(calibration_target instrument1 GroundStation3)
	(supports instrument2 image0)
	(supports instrument2 image1)
	(calibration_target instrument2 GroundStation3)
	(calibration_target instrument2 Star0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet6)
)
(:goal (and
	(have_image Planet6 image1)
	(have_image Phenomenon7 image1)
	(have_image Star8 infrared2)
	(have_image Phenomenon9 image0)
	(have_image Star10 infrared2)
	(have_image Planet11 image1)
	(have_image Phenomenon12 image1)
	(have_image Phenomenon13 image0)
	(have_image Planet14 image1)
	(have_image Star15 image0)
	(have_image Planet16 infrared2)
	(have_image Star17 image1)
	(have_image Planet18 infrared2)
	(have_image Planet19 infrared2)
))

)

; plan
1. (turn_to satellite0 groundstation3 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 groundstation3)
   goals met: 0 of 14
2. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 14
3. (calibrate satellite0 instrument2 groundstation3)
   added: (calibrated instrument2)
   goals met: 0 of 14
4. (turn_to satellite0 star15 groundstation3)
   deleted: (pointing satellite0 groundstation3)
   added: (pointing satellite0 star15)
   goals met: 0 of 14
5. (take_image satellite0 star15 instrument2 image0)
   added: (have_image star15 image0)
   goals met: 1 of 14
6. (turn_to satellite0 phenomenon9 star15)
   deleted: (pointing satellite0 star15)
   added: (pointing satellite0 phenomenon9)
   goals met: 1 of 14
7. (take_image satellite0 phenomenon9 instrument2 image0)
   added: (have_image phenomenon9 image0)
   goals met: 2 of 14
8. (turn_to satellite0 phenomenon13 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon13)
   goals met: 2 of 14
9. (take_image satellite0 phenomenon13 instrument2 image0)
   added: (have_image phenomenon13 image0)
   goals met: 3 of 14
10. (turn_to satellite0 star4 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 star4)
   goals met: 3 of 14
11. (switch_off instrument2 satellite0)
   deleted: (power_on instrument2)
   added: (power_avail satellite0)
   goals met: 3 of 14
12. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 3 of 14
13. (calibrate satellite0 instrument0 star4)
   added: (calibrated instrument0)
   goals met: 3 of 14
14. (turn_to satellite0 phenomenon12 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon12)
   goals met: 3 of 14
15. (take_image satellite0 phenomenon12 instrument0 image1)
   added: (have_image phenomenon12 image1)
   goals met: 4 of 14
16. (turn_to satellite0 phenomenon7 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 phenomenon7)
   goals met: 4 of 14
17. (take_image satellite0 phenomenon7 instrument0 image1)
   added: (have_image phenomenon7 image1)
   goals met: 5 of 14
18. (turn_to satellite0 planet11 phenomenon7)
   deleted: (pointing satellite0 phenomenon7)
   added: (pointing satellite0 planet11)
   goals met: 5 of 14
19. (take_image satellite0 planet11 instrument0 image1)
   added: (have_image planet11 image1)
   goals met: 6 of 14
20. (turn_to satellite0 planet14 planet11)
   deleted: (pointing satellite0 planet11)
   added: (pointing satellite0 planet14)
   goals met: 6 of 14
21. (take_image satellite0 planet14 instrument0 image1)
   added: (have_image planet14 image1)
   goals met: 7 of 14
22. (turn_to satellite0 planet16 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet16)
   goals met: 7 of 14
23. (take_image satellite0 planet16 instrument0 infrared2)
   added: (have_image planet16 infrared2)
   goals met: 8 of 14
24. (turn_to satellite0 planet18 planet16)
   deleted: (pointing satellite0 planet16)
   added: (pointing satellite0 planet18)
   goals met: 8 of 14
25. (take_image satellite0 planet18 instrument0 infrared2)
   added: (have_image planet18 infrared2)
   goals met: 9 of 14
26. (turn_to satellite0 planet19 planet18)
   deleted: (pointing satellite0 planet18)
   added: (pointing satellite0 planet19)
   goals met: 9 of 14
27. (take_image satellite0 planet19 instrument0 infrared2)
   added: (have_image planet19 infrared2)
   goals met: 10 of 14
28. (turn_to satellite0 planet6 planet19)
   deleted: (pointing satellite0 planet19)
   added: (pointing satellite0 planet6)
   goals met: 10 of 14
29. (take_image satellite0 planet6 instrument0 image1)
   added: (have_image planet6 image1)
   goals met: 11 of 14
30. (turn_to satellite0 star10 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star10)
   goals met: 11 of 14
31. (take_image satellite0 star10 instrument0 infrared2)
   added: (have_image star10 infrared2)
   goals met: 12 of 14
32. (turn_to satellite0 star17 star10)
   deleted: (pointing satellite0 star10)
   added: (pointing satellite0 star17)
   goals met: 12 of 14
33. (take_image satellite0 star17 instrument0 image1)
   added: (have_image star17 image1)
   goals met: 13 of 14
34. (turn_to satellite0 star8 star17)
   deleted: (pointing satellite0 star17)
   added: (pointing satellite0 star8)
   goals met: 13 of 14
35. (take_image satellite0 star8 instrument0 infrared2)
   added: (have_image star8 infrared2)
   goals met: 14 of 14
